"""Варіант 2"""

rik = int(input('Введіть рік:'))
koef_4 = 4  #коефіцієнт для визначення приналежності до високосного кожного 4-го року
koef_100 = 100  #коефіцієнт для виключення кожного 100-го року
koef_400 = 400  #коефіцієнт для включення кожного 400-го року до списку високосних
if (not rik % koef_4 and rik % koef_100) or (not rik % koef_400):
    print('YES')
else:
    print('NO')

"""Варіант 3"""

rik = int(input('Введіть рік:'))
koef_4 = 4  #коефіцієнт для визначення приналежності до високосного кожного 4-го року
koef_100 = 100  #коефіцієнт для виключення кожного 100-го року
koef_400 = 400  #коефіцієнт для включення кожного 400-го року до списку високосних

print('YES' if (not rik % koef_4 and rik % koef_100) or (not rik % koef_400) else "NO")
